import json
import requests
import pandas as pd
import os


vcard = "0011613"



url = "https://www.ine.pt/ine/json_indicador/pindica.jsp"
params = {
    "op": "2",
    "varcd": vcard,
    "Dim1": "T",
    "lang": "PT"
    }



# Geocod::
#Dim2=['PT', '1', '11', '0312']

Dim2=lista_strings = strings_list = ['1601', '1602', '1603', '1604', '1605', '1606', '1607',
                                     '1608', '1609', '1610', '0301', '0302', '0303', '0306', 
                                     '0310', '0313', '0304', '0307', '0308', '1705', '0309', 
                                     '0311', '0312', '0314', '0104', '0107', '1304', '1306', 
                                     '1308', '0113', '1310', '1312', '1313', '0109', '1314', 
                                     '0116', '1318', '0119', '1315', '1316', '1317', '1702', 
                                     '1703', '1706', '1709', '1712', '1713', '1301', '1302', 
                                     '0106', '0305', '1804', '1303', '1305', '1307', '1309', 
                                     '1311', '1813', '1701', '1801', '0403', '0404', '1805', 
                                     '1704', '1807', '1707', '1812', '1708', '1710', '1711', 
                                     '1815', '1818', '1819', '1820', '0409', '0914', '1714', 
                                     '0401', '0402', '0405', '0406', '0407', '0408', '0410', 
                                     '0411', '0412', '1001', '1101', '1102', '1005', '1104', 
                                     '1006', '1108', '1011', '1012', '1014', '1112', '1113', 
                                     '0101', '0102', '0103', '0105', '0108', '0110', '0112', 
                                     '0114', '0115', '0117', '0118', '0601', '0602', '0603', 
                                     '0604', '0605', '0606', '0607', '0111', '0608', '0609', 
                                     '0610', '1808', '0611', '0612', '0613', '0614', '0615', 
                                     '0616', '0617', '1002', '1003', '1004', '1007', '1008', 
                                     '1009', '1010', '1013', '1015', '1016', '0901', '1802', 
                                     '1803', '1806', '1809', '1810', '1811', '1814', '1816', 
                                     '1817', '1821', '1822', '1823', '1824', '0502', '0505', 
                                     '0506', '0507', '0508', '0511', '1401', '1402', '1408', 
                                     '1410', '1411', '1413', '1421', '1417', '0509', '1418', 
                                     '1419', '0510', '1420', '0902', '0501', '0903', '0503', 
                                     '0904', '0905', '0504', '0906', '0907', '0908', '0909', 
                                     '0910', '0911', '0912', '0913', '1502', '1503', '1115',
                                     '1504', '1105', '1106', '1107', '1109', '1506', '1507', 
                                     '1116', '1110', '1508', '1510', '1511', '1512', '1111', 
                                     '1114', '1501', '1505', '0211', '1509', '1513', '0201', 
                                     '0202', '0203', '0204', '0205', '0206', '0207', '0208', 
                                     '0209', '0210', '0212', '0213', '0214', '1403', '1404', 
                                     '1103', '1405', '1406', '1407', '1409', '1412', '1414', 
                                     '1415', '1416', '1201', '1202', '1203', '1204', '1205', 
                                     '1206', '1207', '1208', '1209', '1210', '1211', '1212', 
                                     '1213', '1214', '1215', '0701', '0702', '0703', '0704', 
                                     '0705', '0706', '0707', '0708', '0709', '0710', '0711', 
                                     '0712', '0713', '0714', '0801', '0802', '0803', '0804', 
                                     '0805', '0806', '0807', '0808', '0809', '0810', '0811', 
                                     '0812', '0813', '0814', '0815', '0816']

                                     


D1 = []
D2 = []
D3 = []
D4 = []
D5 = []
z = 0



for Geocod in Dim2:
    
    #print(Geocod) 


    url = "https://www.ine.pt/ine/json_indicador/pindica.jsp"
    params = {
    "op": "2",
    "varcd": vcard,
    "Dim1": "T",
    "Dim2": Geocod,
    "lang": "PT"
    }

    response = requests.get(url, params=params)



    if response.status_code == 200:
        data = response.json()
    else:
        print("Erro ao fazer a solicitação: status code", response.status_code)

    n_anos = len(data[0]['Dados'])

    #print (data)

    Periodos = data[0]['Dados'].keys()



    for a in range(n_anos):
        if a < 10:
            Periodo = str(list(Periodos)[len(Periodos)- 1 - a])
            for i in range(len(data[0]['Dados'][str(Periodo)])):
                
                Atividades = data[0]['Dados'][Periodo][i]['dim_3_t']
                Total = data[0]['Dados'][Periodo][i].get('valor', 'na')
                N_Dim2 = data[0]['Dados'][Periodo][i]['geodsg']
                D1.append(Periodo)
                D2.append(N_Dim2)
                D3.append(Atividades)
                D4.append(Total)
                
    z = z+1



dataf = {'Período de referência dos dados': D1,
            'Localização geográfica': D2,
            'Sexo': D3,
            
            'Densidade Populacional': D4
        }

data2 = pd.DataFrame(dataf)

print (data2)

path = r'C:\Users\Andre Pires\OneDrive - LCSD - Associação Data Colab\Documentos\código\SmartCity_Famalicao\integradas\OrdenamentoDoTerritório'
file = 'dataINE_OrdenamentoDoTerritório_CidadesPortuguesas_' + vcard + '.csv'
data2.to_csv(os.path.join(path, file), index=False)